app/Controllers/Aluno.php

SELECT *
FROM `aluno`
---
    public function index()
    {
        $dados = $this->alunoModel->findAll();

DELETE FROM `aluno`
WHERE `id` IN ('22')
---
    public function excluir($id){
        $this->alunoModel->delete($id);