app/Controllers/Login.php

SELECT *
FROM `usuario`
WHERE `nome` = 'jotaveqs'
AND `senha` = 'jotaveqs'
---
    public function authenticate()
    {
        // Obter os dados do formulário
        $nome = $this->request->getPost('nome');
        $senha = $this->request->getPost('senha');

        // Verificar se os dados estão vazios
        if (empty($nome) || empty($senha)) {
            return redirect()->back()->withInput()->with('error', 'Preencha todos os campos!');
        }

        // Conectar ao banco de dados
        $db = \Config\Database::connect();

        // Selecionar o usuário com o nome e senha informados
        $query = $db->table('usuario')->where('nome', $nome)->where('senha', $senha)->get();