app/Controllers/Usuario.php

SELECT *
FROM `usuario`
---
    public function index()
    {
        $dados = $this->usuarioModel->findAll();

INSERT INTO `usuario` (`nome`, `email`, `telefone`, `senha`) VALUES ('jotave', 'jotave@lindo.com', '85992476347', 'e3050067fc0bb156ab4904c7b2b5a2b7')
---
    public function cadastrar(){
        $usuario = $this->request->getPost();
        $usuario['senha'] = md5("senhaforte");
        $this->usuarioModel->save($usuario);

SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '9'
---
    public function editar($id){
        $dados = $this->usuarioModel->find($id);